Revit 2024 API
BuiltInFailures.MEPCalculationFailures.AtLeastOneEquipmentOnDuty Property
 There should be at least one equipment on duty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AtLeastOneEquipmentOnDuty { get; }
Visual Basic
Public Shared ReadOnly Property AtLeastOneEquipmentOnDuty As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AtLeastOneEquipmentOnDuty {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace